Autodesk.Revit.DB.TransactionStatus
An enumerated type listing the possible statuses associated with a Transaction, TransactionGroup, or SubTransaction,
or the result of a particular method call on one of those objects.
Since:
2011

Autodesk.Revit.DB.TransactionStatus.Proceed
while still in error handling (internal status)

Autodesk.Revit.DB.TransactionStatus.Error
error while committing or rolling back

Autodesk.Revit.DB.TransactionStatus.Pending
returned from error handling that took over managing the transaction

Autodesk.Revit.DB.TransactionStatus.Committed
simply committed, ended an empty transaction, flushed all, or undo is disabled

Autodesk.Revit.DB.TransactionStatus.RolledBack
rolled back (aborted)

Autodesk.Revit.DB.TransactionStatus.Started
transaction has begun (until committed or rolled back)

Autodesk.Revit.DB.TransactionStatus.Uninitialized
initial value, the transaction has not been started yet in this status